Revit 2024 API
MultiSegmentGrid.IsValidSketchPlaneId Method
 Identifies whether provided element id corresponds to a SketchPlane that is valid for GridChain creation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsValidSketchPlaneId(
	Document document,
	ElementId elemId
)
Visual Basic
Public Shared Function IsValidSketchPlaneId ( _
	document As Document, _
	elemId As ElementId _
) As Boolean
Visual C++
public:
static bool IsValidSketchPlaneId(
	Document^ document,
	ElementId^ elemId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
elemId
Type: Autodesk.Revit.DB.ElementId
 Element id.
Return Value
 True if elemId is the element id of a horizontal SketchPlane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MultiSegmentGrid Class
Autodesk.Revit.DB Namespace